# GlobalParamInvalidElemParamValue Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GlobalParameterFailures..::..GlobalParamInvalidElemParamValue Property
BuiltInFailures..::..GlobalParameterFailures Class See Also
---
Invalid value of parameter %1!s! in highlighted element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId GlobalParamInvalidElemParamValue { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GlobalParamInvalidElemParamValue As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ GlobalParamInvalidElemParamValue {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GlobalParameterFailures Class
Autodesk.Revit.DB Namespace